Ran Plan for dir: `deployment/dev/terraform` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis/bin/terraform1.7.0 plan -input=false -refresh -out \"/atlantis/repos/broadinstitute/backstage/1/default/deployment/dev/terraform/development-default.tfplan\" \\-\\t\\a\\r\\g\\e\\t\\=\\g\\o\\o\\g\\l\\e\\_\\s\\t\\o\\r\\a\\g\\e\\_\\b\\u\\c\\k\\e\\t\\.\\t\\e\\c\\h\\-\\d\\o\\c\\s" in "/atlantis/repos/broadinstitute/backstage/1/default/deployment/dev/terraform": exit status 1
google_storage_bucket.tech-docs: Refreshing state... [id=bits-backstage-dev-tech-docs]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # google_storage_bucket.tech-docs must be replaced
-/+ resource "google_storage_bucket" "tech-docs" {
      - default_event_based_hold    = false -> null
      ~ effective_labels            = {} -> (known after apply)
      - enable_object_retention     = false -> null
      ~ id                          = "bits-backstage-dev-tech-docs" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "bits-backstage-dev-tech-docs" -> "bits-backstage-dev-techdocs" # forces replacement
      ~ public_access_prevention    = "inherited" -> (known after apply)
      - requester_pays              = false -> null
      ~ rpo                         = "DEFAULT" -> (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/bits-backstage-dev-tech-docs" -> (known after apply)
      ~ terraform_labels            = {} -> (known after apply)
      ~ url                         = "gs://bits-backstage-dev-tech-docs" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ lifecycle_rule {
          - condition {
              - age                        = 365 -> null
              - days_since_custom_time     = 0 -> null
              - days_since_noncurrent_time = 0 -> null
              - matches_prefix             = [] -> null
              - matches_storage_class      = [] -> null
              - matches_suffix             = [] -> null
              - no_age                     = false -> null
              - num_newer_versions         = 1 -> null
              - with_state                 = "ANY" -> null
            }
          + condition {
              + age                   = 365
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + num_newer_versions    = 1
              + with_state            = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
╷
│ Error: Instance cannot be destroyed
│ 
│   on main.tf line 38:
│   38: resource "google_storage_bucket" "tech-docs" {
│ 
│ Resource google_storage_bucket.tech-docs has lifecycle.prevent_destroy set,
│ but the plan calls for this resource to be destroyed. To avoid this error
│ and continue with the plan, either disable lifecycle.prevent_destroy or
│ reduce the scope of the plan using the -target option.
╵

```
</details>